#+TITLE: Reproducible research with Emacs org-mode
#+PROPERTY: cache yes
#+PROPERTY: session *MATLAB*
#+PROPERTY: noweb no-export
#+BEGIN_LaTeX
\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Plan}
\tableofcontents[currentsection]
\end{frame}}
#+END_LATEX

** Code evaluation
- example:
  #+BEGIN_SRC matlab :exports both
  [pi exp(1) sqrt(2)]
  #+END_SRC

#+RESULTS[c3410b31c0bb8ebf8cefc8574df68598e0d77272]:
| 3.1416 | 2.7183 | 1.4142 |


- code is tagged 
  - see [[~/talks/tools-seminar-org-mode.org][source file]]
- can be evaluated 
  - place the cursor within the block 
  - and type =Ctrl+c, Ctrl+c=
- options control the export 
  - see the [[http://orgmode.org/worg/org-contrib/babel/header-args.html][manual]]
- the value of =ans= after evaluation is included 
** Literate programming
- uses the noweb syntax
  - see, [[http://orgmode.org/manual/Noweb-reference-syntax.html#Noweb-reference-syntax][user manual]] 
  - options control the export, see [[http://orgmode.org/manual/noweb.html#noweb][noweb options]]
- =data= block
  #+name: data
  #+BEGIN_SRC matlab 
  a = 1; b = 2;
  #+END_SRC
- =computation= block
  #+name: computation
  #+BEGIN_SRC matlab 
  a + b
  #+END_SRC
- putting them together
  #+name: result
  #+BEGIN_SRC matlab :cache no :results append :exports both :tangle test.m 
  <<data>> 
  <<computation>> 
  #+END_SRC

#+RESULTS: result
: 3

